// Открывает билет/квитанцию по типу квитанции в браузере
// Параметры:
//   Билет - Строка - Номер билета/квитанции в гиис. 
//
Процедура ОткрытьКвитанциюВБраузере(Билет) Экспорт
	
	Программа = МаркировкаПовтИсп.ПрограммаДоступаКГИИСДМДК();
	
	СсылкаКвитанции = МаркировкаВызовСервера.ПолучитьСсылкуПереходаВБраузере(Билет);
	
	Если Программа = ПредопределенноеЗначение("Перечисление.ВидыПрограммДоступаКГИИСДМДК.Авто")
		ИЛИ НЕ ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент() Тогда
		
		ЗапуститьПриложение(СсылкаКвитанции);
		
	ИначеЕсли Программа = ПредопределенноеЗначение("Перечисление.ВидыПрограммДоступаКГИИСДМДК.ChromiumGOST") Тогда
		
		ДанныеЗапуска = Новый Массив();
		ДанныеЗапуска.Добавить(
			ДомашнийКаталог()
			+ "\AppData\Local\Chromium\Application\chrome.exe"
		);
		ДанныеЗапуска.Добавить(СсылкаКвитанции);
		
		ОбщегоНазначенияКлиентСервер.ЗапуститьПрограмму(
			ДанныеЗапуска,
			ОбщегоНазначенияКлиентСервер.ПараметрыЗапускаПрограммы()
		);
		
	ИначеЕсли Программа = ПредопределенноеЗначение("Перечисление.ВидыПрограммДоступаКГИИСДМДК.Yandex") Тогда
		
		ДанныеЗапуска = Новый Массив();
		ДанныеЗапуска.Добавить(
			ДомашнийКаталог()
			+ "\AppData\Local\Yandex\YandexBrowser\Application\browser.exe"
		);
		ДанныеЗапуска.Добавить(СсылкаКвитанции);
		
		ОбщегоНазначенияКлиентСервер.ЗапуститьПрограмму(
			ДанныеЗапуска,
			ОбщегоНазначенияКлиентСервер.ПараметрыЗапускаПрограммы()
		);
	Иначе
		ВызватьИсключение НСтр("ru='Неожиданный тип программы доступа к ГИИС ДМДК'");
	КонецЕсли;
	
КонецПроцедуры

// Определяет домашний каталог пользователь для windows-клиента
// Возвращаемое значение:
//   Строка - полный путь до домашнего каталога пользователя
Функция ДомашнийКаталог() Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент() Тогда
		ВызватьИсключение НСтр("ru='Поддерживается только windows клиент'");
	КонецЕсли;
	
	Параметры = ОбщегоНазначенияКлиентСервер.ПараметрыЗапускаПрограммы();
	Параметры.ПолучитьПотокВывода = Истина;
	Параметры.ПолучитьПотокОшибок = Истина;
	Параметры.ДождатьсяЗавершения = Истина;
	
	пр = Новый Массив();
	пр.Добавить("echo");
	пр.Добавить("%userprofile%");
	
	Результат = ОбщегоНазначенияКлиентСервер.ЗапуститьПрограмму(
		пр,
		Параметры
	);
	
	Если Результат.КодВозврата <> 0 Тогда
		ВызватьИсключение Результат.ПотокОшибок;
	КонецЕсли;
	
	Возврат СокрЛП(Результат.ПотокВывода);
	
КонецФункции